#include <iostream>
using namespace std;
/*
    3個人的圓桌 2次
    123->132
    4人 3次
    1234->1243->2143
    5人 4次
    12345->12354->12534->12543->21543
    6人 6次
    123456->123465->123645->123654->
    132654->312654->321654
    ------------------------------------------
    規律分成奇數偶數
    奇數:
        將最大數移動到最中間位置
        將前後兩部分的數字 升序轉降序
    偶數:
        將整個數列除以二
        將前後兩部分的數字 升序轉後序
    ------------------------------------------
    2個數字升序轉後序所需交換的次數 2次
    12->21
    3個數字 3次
    123->132->312->321
    4個數字 6次
    1234->1243->1423->4123->4132->4312->4321
    5個數字 10次
    12345->12354->12534->15234->51234->
    51243->51423->54123->54132->54312->
    54321
    ------------------------------------------
    假設
    A2=2
    A3=3
    A4=6
    A5=10
    .....
    An=An*(An-1)/2;
    ------------------------------------------
    結論:假設N個人圍圓桌
    N為奇數所需交換次數為 
    最大值移動步數: (N+1)/2
    前後組數字升序轉降序: 2*(N+1)/2*((N+1)/2-1)/2
    總步數: (N+1)/2+2*(N+1)/2*((N+1)/2-1)/2

    N為偶數所需交換次數為
    前後組數字升序轉降序 2*(N)*(N-1)/2
    總步數: (N)*(N-1)
    
*/
int main() {
    int cases;
    scanf("%d", &cases);
    while (cases--) {
        int num;
        scanf("%d", &num);
        if (num % 2 == 0) {
            num /= 2;
            printf("%d\n", num * (num - 1));
        } else {
            num = (num - 1) / 2;
            printf("%d\n", num + num * (num - 1));
        }
    }
    return 0;
}